![cover](cover/14.%20Pivot%20Table.png)

#### Outline
* Pivot Table - Index
* Values
* Aggfunc
  * Sum
  * Mean
  * Min
  * Max
* Margins

### What is a pivot table?

A pivot table is a transformation we can apply to our dataset(s) to restructure them around any given column, and represent its values using aggregate functions. </br>
This powerful tool allows us to group and summarise our datasets.

**Figure 1**

*pivot_table() function demonstration*

<img src="diagrams/pivot_table.png" alt="pivot table" width="800">

*A diagram depicting the pivot_table() function applied to a dataframe, below a dataframe with aggregate values in relation to an index column is produced*

##### Import Pandas

In [1]:
import pandas

##### Import Datasets

In [2]:
games = pandas.read_csv('./datasets/games.csv')
revenue = pandas.read_csv('./datasets/region_revenue.csv')

In [3]:
games

     name  score  coins_gathered  rounds_survived
0     ACE   1420             230               12
1   BLITZ   1980             310               18
2   COMET   1750             270               14
3     ACE   2200             350               20
4    ECHO   1890             290               17
5   FLASH   1640             265               13
6     ACE   2105             330               19
7   COMET   2020             315               16
8   BLITZ   1580             250               11
9   COMET   1930             300               15
10   ECHO   1675             240               12
11  COMET   1855             280               14

In [4]:
revenue

   region product  revenue  units_sold
0   North   Alpha     5000          40
1   South    Beta     5250          42
2    East   Gamma     5500          44
3    West   Alpha     5750          46
4   North    Beta     6000          48
5   South   Gamma     6250          50
6    East   Alpha     6500          52
7    West    Beta     6750          54
8   North   Gamma     7000          56
9   South   Alpha     7250          58
10   East    Beta     7500          60
11   West   Gamma     7750          62

### pivot_table() - index

`dataset.pivot_table(index='')`

Returns a dataframe where each row has a grouped value for the index column and aggregate values for the remaining columns

In [5]:
games.pivot_table(index='name') # pivot_table via the name column

       coins_gathered  rounds_survived        score
name
ACE        303.333333            17.00  1908.333333
BLITZ      280.000000            14.50  1780.000000
COMET      291.250000            14.75  1888.750000
ECHO       265.000000            14.50  1782.500000
FLASH      265.000000            13.00  1640.000000

In [6]:
# leads to error because pandas tries to apply aggfunc (mean function) to strings in the product column
revenue.pivot_table(index='region')

TypeError: agg function failed [how->mean,dtype->object]

### values

`dataset.pivot_table(values=[''])`

Allows us to specify which column(s) we wish to keep

In [7]:
revenue.pivot_table(index='region', values=['revenue', 'units_sold'])   # now we can exclude the products column and aviod the error

        revenue  units_sold
region
East     6500.0        52.0
North    6000.0        48.0
South    6250.0        50.0
West     6750.0        54.0

In [8]:
games.pivot_table(index='name', values='score') # we can also look at only the score column for each player

             score
name
ACE    1908.333333
BLITZ  1780.000000
COMET  1888.750000
ECHO   1782.500000
FLASH  1640.000000

### aggfunc

`dataset.pivot_table(aggfunc='')`

Determines the function which will be used to produce the aggregate values

#### sum
Gives us an aggregated sum of the values for each entry within the column

In [9]:
games.pivot_table(index='name', values='score', aggfunc='sum')  # change the aggregate function to sum

       score
name
ACE     5725
BLITZ   3560
COMET   7555
ECHO    3565
FLASH   1640

In [10]:
revenue.pivot_table(index='region', 
                    values=['revenue', 'units_sold'],
                    aggfunc='sum'   # change the aggregate function to sum
                    )

        revenue  units_sold
region
East      19500         156
North     18000         144
South     18750         150
West      20250         162

#### mean
Gives us the aggregated average, or arithmetic mean of the values for each entry within the column

In [11]:
games.pivot_table(index='name', values='score', aggfunc='mean') # change the aggregate function to mean (default)

             score
name
ACE    1908.333333
BLITZ  1780.000000
COMET  1888.750000
ECHO   1782.500000
FLASH  1640.000000

In [12]:
revenue.pivot_table(index='region', 
                    values=['revenue', 'units_sold'],
                    aggfunc='mean' # change the aggregate function to mean (default)
                    )

        revenue  units_sold
region
East     6500.0        52.0
North    6000.0        48.0
South    6250.0        50.0
West     6750.0        54.0

#### min
Gives us an aggregated minimum value for each entry within the column

In [13]:
games.pivot_table(index='name', values='score', aggfunc='min') # change the aggregate function to min

       score
name
ACE     1420
BLITZ   1580
COMET   1750
ECHO    1675
FLASH   1640

In [14]:
revenue.pivot_table(index='region', 
                    values=['revenue', 'units_sold'],
                    aggfunc='min' # change the aggregate function to sum
                    )

        revenue  units_sold
region
East       5500          44
North      5000          40
South      5250          42
West       5750          46

#### max
Gives us an aggregated minimum value for each entry within the column

In [15]:
games.pivot_table(index='name', values='score', aggfunc='max') # change the aggregate function to max

       score
name
ACE     2200
BLITZ   1980
COMET   2020
ECHO    1890
FLASH   1640

In [16]:
revenue.pivot_table(index='region', 
                    values=['revenue', 'units_sold'],
                    aggfunc='max' # change the aggregate function to max
                    )

        revenue  units_sold
region
East       7500          60
North      7000          56
South      7250          58
West       7750          62

### margins

`dataset.pivot_table(margins=True)`

Creates a row with aggregate values from the entire dataset

In [17]:
revenue.pivot_table(index='region', 
                    values=['revenue', 'units_sold'],
                    aggfunc='sum',
                    margins=True    # show a "total" row at the bottom
                    )

        revenue  units_sold
region
East      19500         156
North     18000         144
South     18750         150
West      20250         162
All       76500         612

In [18]:
games.pivot_table(index='name', aggfunc='mean', margins=True)   # reveal the average for each column of the entire dataset

       coins_gathered  rounds_survived        score
name
ACE        303.333333        17.000000  1908.333333
BLITZ      280.000000        14.500000  1780.000000
COMET      291.250000        14.750000  1888.750000
ECHO       265.000000        14.500000  1782.500000
FLASH      265.000000        13.000000  1640.000000
All        285.833333        15.083333  1837.083333

### For Source code:
https://sites.google.com/view/aorbtech/programming/

#### @Aorb Tech